In [2]:
import pandas as pd

In [4]:
data = pd.read_csv('salaries.csv')
data.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [10]:
# x and y

x =  data.drop(['salary_more_then_100k'],axis='columns')
y = data['salary_more_then_100k']

In [16]:
# label encoder 
from sklearn.preprocessing import LabelEncoder

le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [14]:
x['company_new'] =  le_company.fit_transform(x['company'])

In [18]:
x['job_new'] =  le_company.fit_transform(x['job'])
x['degree_new'] =  le_company.fit_transform(x['degree'])

In [20]:
x.head()

  company                  job     degree  company_new  job_new  degree_new
0  google      sales executive  bachelors            2        2           0
1  google      sales executive    masters            2        2           1
2  google     business manager  bachelors            2        0           0
3  google     business manager    masters            2        0           1
4  google  computer programmer  bachelors            2        1           0

In [22]:
# drop the others

x_new =  x.drop(['company','job','degree'],axis='columns')
x_new.head()

   company_new  job_new  degree_new
0            2        2           0
1            2        2           1
2            2        0           0
3            2        0           1
4            2        1           0

In [24]:
from sklear.tree import DecisionTreeClassifier

ModuleNotFoundError: No module named 'sklear'